---
kind: method
id: M:Autodesk.Revit.DB.DefinitionBindingMap.#ctor
source: html/09d53726-f3ff-8a2e-26ab-89e6afdb6c9a.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap.#ctor Method

Initializes a new instance of the DefinitionBindingMap class

## Syntax (C#)
```csharp
public DefinitionBindingMap()
```